[    {
        "type": "NiFi",
        "question": "Do you value knowledge over your own enjoyment in life?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {   "type": "NiTe",
        "question": "Do you value more your ideals over achieving your goals in life even if this ideals are not realistic and achievable?",
        "func_mbti_yes": "intuitive",
        "func_mbti_no": "thinker"
    },
    {
        "type": "SeTe",
        "question": "Do you make decisions based on a well thought plan more often than you act based on impulsive feelings?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {
        "type": "SeFi",
        "question": "Do you value more having many acquaintances to go to parties with more than a really good friend to do activities with?",
        "func_mbti_yes": "sensor",
        "func_mbti_no": "feeler"
    },


    {
        "type": "NiTi",
        "question": "Are you usually brief and practical in your explanations?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {   "type": "NiFe",
        "question": "Do you feel tired often after socializing for a long period of time?",
        "func_mbti_yes": "intuitive",
        "func_mbti_no": "feeler"
    },
    {
        "type": "SeFe",
        "question": "Do you consider yourself or are sometimes perceived as physically hyperactive?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {
        "type": "SeTi",
        "question": "Do you prefer working in team more than alone?",
        "func_mbti_yes": "sensor",
        "func_mbti_no": "thinker"
    },


     {
        "type": "SiFi",
        "question": "Do you tend to keep your emotions inside and not externalize them?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {   "type": "SiTe",
        "question": "Are you usually the passive or silent one in group conversations?",
        "func_mbti_yes": "sensor",
        "func_mbti_no": "thinker"
    },
    {
        "type": "NeTe",
        "question": "Do you value acting based on specific logical sets of rules more than acting based on what you feel like doing at the time even if it goes against the expected behavior?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {
        "type": "NeFi",
        "question": "Do you find yourself more often than not trying new things or experiences outside of your usual ones but still in your comfort zone or close to it?",
        "func_mbti_yes": "intuitive",
        "func_mbti_no": "feeler"
    },


     {
        "type": "NeFe",
        "question": "Do you value progress and improvement a lot over social stability even if it creates conflict sometimes?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {   "type": "SiFe",
        "question": "Do you have a strong interest in knowledge of specific fields of study you enjoy or value?",
        "func_mbti_yes": "sensor",
        "func_mbti_no": "feeler"
    },
    {
        "type": "SiTi",
        "question": "Are you usually seen or defined by others as cold or not empathetic, usually feeling that you can't understand other people's feelings?",
        "func_mbti_yes": "thinker",
        "func_mbti_no": "feeler"
    },
    {
        "type": "NeTi",
        "question": "Do you enjoy debates and defending your point of view as a hobby more than you consider it just something necessary sometimes?",
        "func_mbti_yes": "intuitive",
        "func_mbti_no": "thinker"
    }

]
